In [2]:
x= 10
print('1',x)

1 10

In [10]:
list = ['asai','kimm']
print(list)

['asai', 'kimm']

In [11]:
print(list[0][1])

s

In [12]:
def add(a, b):
    return a + b
def sub(a, b):
    return a - b

In [13]:
from mo1 import add, sub

ModuleNotFoundError: No module named 'mo1'

In [17]:
import os
os.getcwd()

'D:\\python_workspace'

In [18]:
!dir

 D 드라이브의 볼륨: 새 볼륨
 볼륨 일련 번호: 068F-36EB

 D:\python_workspace 디렉터리

2025-04-22  오후 01:02    <DIR>          .
2025-04-22  오전 09:41    <DIR>          .ipynb_checkpoints
2025-04-18  오후 03:20            13,146 04 웹 크롤링-2 (1).ipynb
2025-04-18  오후 03:19           134,423 1. 웹 스크래핑.ipynb
2025-04-21  오전 11:01           458,307 1. 웹 스크랩핑.ipynb
2025-04-14  오후 04:07                66 bird.py
2025-04-16  오후 01:02            30,164 Day03.ipynb
2025-04-22  오후 12:32            51,853 Day04.ipynb
2025-04-16  오후 07:28            14,246 Day04_2.ipynb
2025-04-17  오후 02:33             6,853 Day05.ipynb
2025-04-21  오후 04:43             6,674 Day06.ipynb
2025-04-22  오후 01:02             3,570 Day07.ipynb
2025-04-18  오전 09:43                33 exam.py
2025-04-14  오후 03:47                 0 foo.txt
2025-04-14  오후 02:53    <DIR>          game
2025-04-14  오후 02:50             1,818 game.zip
2025-04-15  오후 03:49                44 myinfo.json
2025-04-14  오후 02:46    <DIR>          mymode
2025-04-21  오후 12:44    <DIR>          nature_imgs
2025-04-16  오후 01:02    <DIR>          pandas
2025-04-18  오후 12:38            35,075 Untitled.ipynb
2025-04-18  오후 03:28             1,664 Untitled1.ipynb
2025-04-14  오후 04:05    <DIR>          __pycache__
2025-04-22  오전 11:03    <DIR>          데이터분석2
2025-04-16  오후 01:02            11,541 예외처리 및 내장함수.ipynb
2025-04-14  오후 02:49            15,904 클래스.ipynb
              18개 파일             785,381 바이트
               8개 디렉터리  733,625,663,488 바이트 남음

In [19]:
!dir data

 D 드라이브의 볼륨: 새 볼륨
 볼륨 일련 번호: 068F-36EB

 D:\python_workspace 디렉터리

파일을 찾을 수 없습니다.

In [20]:
import pandas as pd

In [53]:
import pandas as pd

data = {
    '이름': [999, 888, 777],
    '나이': [22, 25, 30],
    '성별': [0, 1, 0]
}

# 인덱스는 리스트나 튜플 형태로 순서를 보장해야 해
index = ['F', 's', 't']

df = pd.DataFrame(data, index=index)

print(df)

    이름  나이  성별
F  999  22   0
s  888  25   1
t  777  30   0

In [54]:
print(df)

    이름  나이  성별
F  999  22   0
s  888  25   1
t  777  30   0

In [60]:
df.sort_values(by='t', axis=1)

   성별  나이   이름
F   0  22  999
s   1  25  888
t   0  30  777

In [61]:
import pandas as pd

In [62]:
# 시리즈를 데이터프레임의 새로운 행으로 연결

s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['a', 'b', 'c'])

In [63]:
print(s1)
print(s2)

A    0
B    1
dtype: int64
a    2
b    3
c    4
dtype: int64

In [64]:
print(pd.concat([s1, s2]))

A    0
B    1
a    2
b    3
c    4
dtype: int64

In [65]:
# 옆으로 데이터 열을 연결하고 싶으면 AXIS=1로 인수를 설정

df1 = pd.DataFrame([['멍멍이', '3'], ['야옹이', '10'], ['호랑이', '6'], ['원숭이', '3']],
                   index=['0', '1', '2', '3'],
                   columns = ['동물', '나이'])
df1

    동물  나이
0  멍멍이   3
1  야옹이  10
2  호랑이   6
3  원숭이   3

In [66]:

df2 = pd.DataFrame([['집', '0'], ['초원', '0'], ['수풀', '0'], ['초원', '1']],
                   index=['0', '1', '2', '3'],
                   columns = ['사는곳', '뿔의 개수'])
df2

  사는곳 뿔의 개수
0   집     0
1  초원     0
2  수풀     0
3  초원     1

In [69]:
pd.concat([df1, df2], axis=1)

    동물  나이 사는곳 뿔의 개수
0  멍멍이   3   집     0
1  야옹이  10  초원     0
2  호랑이   6  수풀     0
3  원숭이   3  초원     1

In [70]:
# 병합용 데이터 프레임 생성

df1 = pd.DataFrame(
    {
      '고객번호' : [1001, 1002, 1003, 1004, 1005, 1006, 1007],
      '이름' : ['강감찬', '홍길동', '이순신', '장보고', '유관순', '이율곡', '권율' ]
    },

    columns = ['고객번호', '이름']
)

In [71]:
df1

   고객번호   이름
0  1001  강감찬
1  1002  홍길동
2  1003  이순신
3  1004  장보고
4  1005  유관순
5  1006  이율곡
6  1007   권율

In [72]:
df2 = pd.DataFrame(
    {
      '고객번호' : [1001, 1001, 1005, 1006, 1008, 1001],
      '금액' : [10000, 20000, 15000, 5000, 100000, 30000 ]
    },

    columns = ['고객번호', '금액']
)

In [73]:
df1

   고객번호   이름
0  1001  강감찬
1  1002  홍길동
2  1003  이순신
3  1004  장보고
4  1005  유관순
5  1006  이율곡
6  1007   권율

In [74]:
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [75]:
pd.merge(df1, df2)   # 교집합 병합

   고객번호   이름     금액
0  1001  강감찬  10000
1  1001  강감찬  20000
2  1001  강감찬  30000
3  1005  유관순  15000
4  1006  이율곡   5000